console.log(`Проверка верстки +7

верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ . +4 - есть
логотип в хедере состоит из текстовых элементов +1 - есть
страница содержит ровно один элемент <h1> +1 - есть
добавлен favicon +1 - есть


Вёрстка соответствует макету +35
блок <header> +5 - есть
блок Not only +5 - есть
блок About +5    - есть
блок Our Friends +5 - есть
блок Help +5        - есть
блок In addition +5 - есть
блок <footer> +5    - есть


Требования к css +6
для позиционирования элементов блока Help использована сеточная верстка (flexbox или grid) +2 - есть

при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине +2  - есть

фоновый цвет тянется на всю ширину страницы +2 - есть


Интерактивность элементов +12
элемент About the Shelter в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны +2 -есть
каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки +2
плавная прокрутка по якорям +2 - есть
выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы Main +2 - есть
выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства cursor: pointer, но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +2
обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы +2 - есть`)